Revit 2027 API
StructuralSection.AnalysisParams Property
 Common set of parameters for structural analysis.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionAnalysisParams AnalysisParams { get; }
Public ReadOnly Property AnalysisParams As StructuralSectionAnalysisParams
	Get
public:
property StructuralSectionAnalysisParams^ AnalysisParams {
	StructuralSectionAnalysisParams^ get ();
}
member AnalysisParams : StructuralSectionAnalysisParams with get
Property Value
StructuralSectionAnalysisParams
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace